import React, { useMemo } from "react";
import { ScrollView, Text } from "react-native";
import { useTheme } from "src/context/ThemeContext";
import { createStyles } from "./styles";
import Spacer from "src/components/common/Spacer/Spacer";
import CustomText from "src/components/common/CustomText/CustomText";

const text = `
شروط التقدّم للحصول على صفة وكيل معتمد

1. صحة المعلومات

يقرُّ المتقدّم بأن جميع البيانات والمستندات المقدَّمة صحيحة وكاملة ودقيقة، ويتحمّل كامل المسؤولية القانونية عن أي بيانات مضلّلة أو غير صحيحة.

2. الهوية الرسمية

يشترط تقديم صورة واضحة عن هوية وطنية سارية المفعول أو جواز سفر ساري.
ويحق للشركة رفض أي طلب يحتوي على مستندات غير واضحة أو مزوّرة أو منتهية.

3. التحقق الأمني

يوافق المتقدّم على إجراءات التحقق التي تقوم بها الشركة، بما في ذلك:

مطابقة بيانات الهوية مع المعلومات المدخلة

التحقق عبر رقم الهاتف

التحقق عبر البريد الإلكتروني إذا لزم الأمر

4. الاستخدام المسموح

تُستخدم بيانات المتقدّم فقط لغرض التقييم والتحقق ومنحه صفة وكيل معتمد، ولا يجوز استخدامها لأي غرض غير مشروع أو مخالف للقوانين.

5. الالتزام بالأنظمة والسياسات

يوافق المتقدّم على الالتزام بجميع:

سياسات الشركة

شروط الاستخدام

التعليمات الخاصة بالبيع والتسويق

قواعد التعامل مع العملاء

وأي مخالفة قد تؤدي إلى إلغاء صفة الوكيل دون إشعار مسبق.

6. أهلية التقديم

يشترط أن يكون المتقدّم:

قد أتم 18 عامًا

غير محظور من التعامل أو البيع ضمن نطاق عمل الشركة

قادرًا على أداء مهامه دون تعارض مصالح أو مخالفات قانونية

7. سرية المعلومات

تتعهد الشركة بالحفاظ على سرية بيانات المتقدّم وعدم مشاركتها مع أي جهة خارجية إلا إذا تطلب القانون ذلك، أو كان ذلك ضمن عمليات التحقق المشروعة.

8. حق القبول أو الرفض

يحق للشركة قبول أو رفض أي طلب دون تقديم مبررات، وذلك بحسب سياسات التحقق الداخلية.

9. إلغاء الاعتماد

يحق للشركة إلغاء صفة الوكيل في أي من الحالات التالية:

تقديم معلومات غير صحيحة

إساءة استخدام الصلاحيات

مخالفة سياسات الشركة

انقطاع التواصل أو النشاط فترات طويلة

أي سبب تراه الشركة مؤثرًا على سلامة العمل
`

const AgentTeamRequestTermsScreen = () => {
  const { theme } = useTheme();
  const styles = useMemo(() => createStyles(theme), [theme]);

  return (
    <ScrollView style={styles.container}>
      <CustomText text={text} size={18} color={theme.colors.text} />
      <Spacer height={30} />
    </ScrollView>
  );
};

export default AgentTeamRequestTermsScreen;
